#!/usr/bin/env python
# coding: utf-8

# (content:donate)=
# 
# # 支持网站
# 
# 大家好，我是早起。
# 
# `Pandas`系列从最初发布在知乎和微信公众号的 [pandas数据分析20题](https://mp.weixin.qq.com/s?__biz=Mzg5OTU3NjczMQ==&mid=2247510041&idx=1&sn=28a6f7640eaa1fd496201ee4be615167&chksm=c053ceedf72447fbf2781337993d578848de3fdd90ae138cf08bd394a81d261316f9c675f199&scene=178&cur_album_id=1732748353257406466#rd) ，到后来的 [pandas进阶修炼120题](https://mp.weixin.qq.com/s?__biz=Mzg5OTU3NjczMQ==&mid=2247510058&idx=2&sn=d30f1c1b6fbce81bdbbe02bcaf587996&chksm=c053cedef72447c8820fd7d536d12b0bd5f5625eb3b820f7da708a5c987277d6277271a8c2f7&token=1003699214&lang=zh_CN#rd) ，再到现在的 [pandas进阶修炼300题](https://mp.weixin.qq.com/s/GW6OxfwIp2X8p2X9fcQZOg) 与 [图解pandas](https://pandas.liuzaoqi.com) 网站，**一路走来少不了各位读者、粉丝朋友的鼓励、支持与赞赏**。
# 
# 但一个人更新与维护这么多内容几乎耗费了工作之外的全部时间，为了海内外读者的阅读体验，本网站除了服务器之外还额外购买了CDN加速服务，**如果觉得我的教程对您有所帮助，可以在本页面进行打赏，这将是我继续创作优秀Python数据分析教程的动力**！
# 
# ```{note}
# 微信扫码关注右侧公众号，也是一种支持～ 
# ```
# 
# ## 打赏渠道
# 
# **如果你也想支持网站建设，可以通过微信/支付宝进行打赏，金额不限，赠人玫瑰，手有余香，您小小的打赏将是我更新无限的动力**（PS：如果你有什么想对早起说的，鼓励or建议，都可以在打赏时进行备注）
# 
# ```{figure} https://pic.liuzaoqi.com/picgo/202204141505121.png
# :width: 80%
# :align: center
# ```
# 
# 
# ## 打赏记录
# 
# 为了表达对每一位打赏用户对网站建设的支持，我特地做了一个名单来感谢（PS：**每月更新一次，当前更新时间：2022-04-01**）
# 
# | 时间 | 昵称                         | 金额 | 留言                                     | 早起回复                                     |
# | ------ | ---------------------------- | ------ | ---------------------------------------- |---------------------------------------- |
# | 2022-03-19      | 斯文**                 | ¥200.00      | 加油加油加油                         |感谢支持！ |
# | 2022-03-28      | 方**                 | ¥6.66      | 正在自学中，希望可以增加更多的内容                         |谢谢，网站会陆续更新！ |
# |       |                  |       |                          | |
